GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F25Q24.inc
;----- DMANAIRQ Bits -----------------------------------------------------
AIRQ0            EQU  H'0000'
AIRQ1            EQU  H'0001'
AIRQ2            EQU  H'0002'
AIRQ3            EQU  H'0003'
AIRQ4            EQU  H'0004'
AIRQ5            EQU  H'0005'
AIRQ6            EQU  H'0006'
AIRQ7            EQU  H'0007'


;----- DMANSIRQ Bits -----------------------------------------------------
SIRQ0            EQU  H'0000'
SIRQ1            EQU  H'0001'
SIRQ2            EQU  H'0002'
SIRQ3            EQU  H'0003'
SIRQ4            EQU  H'0004'
SIRQ5            EQU  H'0005'
SIRQ6            EQU  H'0006'
SIRQ7            EQU  H'0007'


;----- PORTW Bits -----------------------------------------------------
RW0              EQU  H'0000'
RW1              EQU  H'0001'
RW2              EQU  H'0002'
RW3              EQU  H'0003'
RW4              EQU  H'0004'
RW5              EQU  H'0005'
RW6              EQU  H'0006'
RW7              EQU  H'0007'


;----- LATW Bits -----------------------------------------------------
LATW0            EQU  H'0000'
LATW1            EQU  H'0001'
LATW2            EQU  H'0002'
LATW3            EQU  H'0003'
LATW4            EQU  H'0004'
LATW5            EQU  H'0005'
LATW6            EQU  H'0006'
LATW7            EQU  H'0007'


;----- PORTWIN0 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'


;----- PORTWIN1 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'


;----- PORTWIN2 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'


;----- PORTWIN3 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'


;----- PORTWIN4 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'


;----- PORTWIN5 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'


;----- PORTWIN6 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'


;----- PORTWIN7 Bits -----------------------------------------------------
IN0              EQU  H'0000'
IN1              EQU  H'0001'
IN2              EQU  H'0002'
IN3              EQU  H'0003'


;----- PORTWCLK Bits -----------------------------------------------------
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'
CLK3             EQU  H'0003'
CLK4             EQU  H'0004'


;----- PORTWDF Bits -----------------------------------------------------
DF0              EQU  H'0000'
DF1              EQU  H'0001'
DF2              EQU  H'0002'
DF3              EQU  H'0003'
DF4              EQU  H'0004'
DF5              EQU  H'0005'
DF6              EQU  H'0006'
DF7              EQU  H'0007'
PWDF0            EQU  H'0000'
PWDF1            EQU  H'0001'
PWDF2            EQU  H'0002'
PWDF3            EQU  H'0003'
PWDF4            EQU  H'0004'
PWDF5            EQU  H'0005'
PWDF6            EQU  H'0006'
PWDF7            EQU  H'0007'


;----- PORTWCON Bits -----------------------------------------------------
CLKEN            EQU  H'0000'


;----- VDDIO2CON Bits -----------------------------------------------------
SEL0             EQU  H'0000'
SEL1             EQU  H'0001'
SEL2             EQU  H'0002'
SEL3             EQU  H'0003'
NOT_HYS          EQU  H'0004'
MD               EQU  H'0007'
SEL0             EQU  H'0000'
SEL1             EQU  H'0001'
SEL2             EQU  H'0002'
SEL3             EQU  H'0003'
NHYS             EQU  H'0004'


;----- ADCG1A Bits -----------------------------------------------------
CGA0             EQU  H'0000'
CGA1             EQU  H'0001'
CGA2             EQU  H'0002'
CGA3             EQU  H'0003'
CGA4             EQU  H'0004'
CGA5             EQU  H'0005'
CGA6             EQU  H'0006'
CGA7             EQU  H'0007'


;----- ADCG1B Bits -----------------------------------------------------
CGB0             EQU  H'0000'
CGB1             EQU  H'0001'
CGB2             EQU  H'0002'
CGB3             EQU  H'0003'
CGB4             EQU  H'0004'
CGB5             EQU  H'0005'
CGB6             EQU  H'0006'
CGB7             EQU  H'0007'


;----- ADCG1C Bits -----------------------------------------------------
CGC0             EQU  H'0000'
CGC1             EQU  H'0001'
CGC2             EQU  H'0002'


;----- LATA Bits -----------------------------------------------------
LATA0            EQU  H'0000'
LATA1            EQU  H'0001'
LATA2            EQU  H'0002'
LATA3            EQU  H'0003'
LATA4            EQU  H'0004'
LATA5            EQU  H'0005'
LATA6            EQU  H'0006'
LATA7            EQU  H'0007'


;----- LATB Bits -----------------------------------------------------
LATB0            EQU  H'0000'
LATB1            EQU  H'0001'
LATB2            EQU  H'0002'
LATB3            EQU  H'0003'
LATB4            EQU  H'0004'
LATB5            EQU  H'0005'
LATB6            EQU  H'0006'
LATB7            EQU  H'0007'


;----- LATC Bits -----------------------------------------------------
LATC0            EQU  H'0000'
LATC1            EQU  H'0001'
LATC2            EQU  H'0002'
LATC3            EQU  H'0003'
LATC4            EQU  H'0004'
LATC5            EQU  H'0005'
LATC6            EQU  H'0006'


;----- TRISA Bits -----------------------------------------------------
TRISA0           EQU  H'0000'
TRISA1           EQU  H'0001'
TRISA2           EQU  H'0002'
TRISA3           EQU  H'0003'
TRISA4           EQU  H'0004'
TRISA5           EQU  H'0005'
TRISA6           EQU  H'0006'
TRISA7           EQU  H'0007'


;----- TRISB Bits -----------------------------------------------------
TRISB0           EQU  H'0000'
TRISB1           EQU  H'0001'
TRISB2           EQU  H'0002'
TRISB3           EQU  H'0003'
TRISB4           EQU  H'0004'
TRISB5           EQU  H'0005'
TRISB6           EQU  H'0006'
TRISB7           EQU  H'0007'


