GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F25Q24.inc
;----- PORTWIN0PPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
PORTWIN00        EQU  H'0000'
PORTWIN01        EQU  H'0001'
PORTWIN02        EQU  H'0002'
PORTWIN03        EQU  H'0003'
PORTWIN04        EQU  H'0004'
PORTWIN05        EQU  H'0005'
PORTWIN00        EQU  H'0000'
PORTWIN01        EQU  H'0001'
PORTWIN02        EQU  H'0002'
PORTWIN03        EQU  H'0003'
PORTWIN04        EQU  H'0004'
PORTWIN05        EQU  H'0005'


;----- PORTWIN1PPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
PORTWIN10        EQU  H'0000'
PORTWIN11        EQU  H'0001'
PORTWIN12        EQU  H'0002'
PORTWIN13        EQU  H'0003'
PORTWIN14        EQU  H'0004'
PORTWIN15        EQU  H'0005'
PORTWIN10        EQU  H'0000'
PORTWIN11        EQU  H'0001'
PORTWIN12        EQU  H'0002'
PORTWIN13        EQU  H'0003'
PORTWIN14        EQU  H'0004'
PORTWIN15        EQU  H'0005'


;----- PORTWCLKPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
PORTWCLK0        EQU  H'0000'
PORTWCLK1        EQU  H'0001'
PORTWCLK2        EQU  H'0002'
PORTWCLK3        EQU  H'0003'
PORTWCLK4        EQU  H'0004'
PORTWCLK5        EQU  H'0005'
PORTWCLK0        EQU  H'0000'
PORTWCLK1        EQU  H'0001'
PORTWCLK2        EQU  H'0002'
PORTWCLK3        EQU  H'0003'
PORTWCLK4        EQU  H'0004'
PORTWCLK5        EQU  H'0005'


;----- RC3I2C Bits -----------------------------------------------------
TH0              EQU  H'0000'
TH1              EQU  H'0001'
SLEW0            EQU  H'0006'
SLEW1            EQU  H'0007'
TH0              EQU  H'0000'
TH1              EQU  H'0001'
SLEW0            EQU  H'0006'
SLEW1            EQU  H'0007'
I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CSLEW0         EQU  H'0006'
I2CSLEW1         EQU  H'0007'
I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CSLEW0         EQU  H'0006'
I2CSLEW1         EQU  H'0007'


;----- RC4I2C Bits -----------------------------------------------------
TH0              EQU  H'0000'
TH1              EQU  H'0001'
SLEW0            EQU  H'0006'
SLEW1            EQU  H'0007'
TH0              EQU  H'0000'
TH1              EQU  H'0001'
SLEW0            EQU  H'0006'
SLEW1            EQU  H'0007'
I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CSLEW0         EQU  H'0006'
I2CSLEW1         EQU  H'0007'
I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CSLEW0         EQU  H'0006'
I2CSLEW1         EQU  H'0007'


;----- RB1I2C Bits -----------------------------------------------------
TH0              EQU  H'0000'
TH1              EQU  H'0001'
PU0              EQU  H'0004'
PU1              EQU  H'0005'
SLEW0            EQU  H'0006'
SLEW1            EQU  H'0007'
TH0              EQU  H'0000'
TH1              EQU  H'0001'
PU0              EQU  H'0004'
PU1              EQU  H'0005'
SLEW0            EQU  H'0006'
SLEW1            EQU  H'0007'
I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CPU0           EQU  H'0004'
I2CPU1           EQU  H'0005'
I2CSLEW0         EQU  H'0006'
I2CSLEW1         EQU  H'0007'
I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CPU0           EQU  H'0004'
I2CPU1           EQU  H'0005'
I2CSLEW0         EQU  H'0006'
I2CSLEW1         EQU  H'0007'


;----- RB2I2C Bits -----------------------------------------------------
TH0              EQU  H'0000'
TH1              EQU  H'0001'
PU0              EQU  H'0004'
PU1              EQU  H'0005'
SLEW0            EQU  H'0006'
SLEW1            EQU  H'0007'
TH0              EQU  H'0000'
TH1              EQU  H'0001'
PU0              EQU  H'0004'
PU1              EQU  H'0005'
SLEW0            EQU  H'0006'
SLEW1            EQU  H'0007'
I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CPU0           EQU  H'0004'
I2CPU1           EQU  H'0005'
I2CSLEW0         EQU  H'0006'
I2CSLEW1         EQU  H'0007'
I2CTH0           EQU  H'0000'
I2CTH1           EQU  H'0001'
I2CPU0           EQU  H'0004'
I2CPU1           EQU  H'0005'
I2CSLEW0         EQU  H'0006'
I2CSLEW1         EQU  H'0007'


;----- I2C1RXB Bits -----------------------------------------------------


;----- I2C1TXB Bits -----------------------------------------------------


;----- I2C1CNT Bits -----------------------------------------------------
CNT0             EQU  H'0000'
CNT1             EQU  H'0001'
CNT2             EQU  H'0002'
CNT3             EQU  H'0003'
CNT4             EQU  H'0004'
CNT5             EQU  H'0005'
CNT6             EQU  H'0006'
CNT7             EQU  H'0007'
I2C1CNT0         EQU  H'0000'
I2C1CNT1         EQU  H'0001'
I2C1CNT2         EQU  H'0002'
I2C1CNT3         EQU  H'0003'
I2C1CNT4         EQU  H'0004'
I2C1CNT5         EQU  H'0005'
I2C1CNT6         EQU  H'0006'
I2C1CNT7         EQU  H'0007'


;----- I2C1CNTH Bits -----------------------------------------------------
CNT8             EQU  H'0000'
CNT9             EQU  H'0001'
CNT10            EQU  H'0002'
CNT11            EQU  H'0003'
CNT12            EQU  H'0004'
CNT13            EQU  H'0005'
CNT14            EQU  H'0006'
CNT15            EQU  H'0007'
I2C1CNT8         EQU  H'0000'
I2C1CNT9         EQU  H'0001'
I2C1CNT10        EQU  H'0002'
I2C1CNT11        EQU  H'0003'
I2C1CNT12        EQU  H'0004'
I2C1CNT13        EQU  H'0005'
I2C1CNT14        EQU  H'0006'
I2C1CNT15        EQU  H'0007'


;----- I2C1ADB0 Bits -----------------------------------------------------


;----- I2C1ADB1 Bits -----------------------------------------------------


;----- I2C1ADR0 Bits -----------------------------------------------------


