GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F25Q24.inc
;----- PWM3LDS Bits -----------------------------------------------------
LDS0             EQU  H'0000'
LDS1             EQU  H'0001'
LDS2             EQU  H'0002'
LDS3             EQU  H'0003'
LDS4             EQU  H'0004'
LDS5             EQU  H'0005'
LDS6             EQU  H'0006'
LDS7             EQU  H'0007'


;----- PWM3PR Bits -----------------------------------------------------


;----- PWM3PRH Bits -----------------------------------------------------


;----- PWM3CPRE Bits -----------------------------------------------------


;----- PWM3PIPOS Bits -----------------------------------------------------


;----- PWM3GIR Bits -----------------------------------------------------
S1P1IF           EQU  H'0000'
S1P2IF           EQU  H'0001'


;----- PWM3GIE Bits -----------------------------------------------------
S1P1IE           EQU  H'0000'
S1P2IE           EQU  H'0001'


;----- PWM3CON Bits -----------------------------------------------------
ERSNOW           EQU  H'0000'
ERSPOL           EQU  H'0001'
LD_PWM3CON       EQU  H'0002'
EN               EQU  H'0007'


;----- PWM3S1CFG Bits -----------------------------------------------------
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
PPEN             EQU  H'0003'
POL1             EQU  H'0006'
POL2             EQU  H'0007'
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'


;----- PWM3S1P1 Bits -----------------------------------------------------


;----- PWM3S1P1H Bits -----------------------------------------------------


;----- PWM3S1P2 Bits -----------------------------------------------------


;----- PWM3S1P2H Bits -----------------------------------------------------


;----- PWMLOAD Bits -----------------------------------------------------
MPWM1LD          EQU  H'0000'
MPWM2LD          EQU  H'0001'
MPWM3LD          EQU  H'0002'


;----- PWMEN Bits -----------------------------------------------------
MPWM1EN          EQU  H'0000'
MPWM2EN          EQU  H'0001'
MPWM3EN          EQU  H'0002'


;----- IPR0 Bits -----------------------------------------------------
SWIP             EQU  H'0000'
HLVDIP           EQU  H'0001'
OSFIP            EQU  H'0002'
CSWIP            EQU  H'0003'
NVMIP            EQU  H'0004'
CLC1IP           EQU  H'0005'
CRCIP            EQU  H'0006'
IOCIP            EQU  H'0007'


;----- IPR1 Bits -----------------------------------------------------
INT0IP           EQU  H'0000'
ADTIP            EQU  H'0001'
ADIP             EQU  H'0002'
ACTIP            EQU  H'0003'
I2C2RXIP         EQU  H'0004'
I2C2TXIP         EQU  H'0005'
I2C2IP           EQU  H'0006'
I2C2EIP          EQU  H'0007'


;----- IPR2 Bits -----------------------------------------------------
ZCD2IP           EQU  H'0000'
CLC5IP           EQU  H'0001'
IOCSRIP          EQU  H'0002'
ZCD1IP           EQU  H'0003'
DMA1SCNTIP       EQU  H'0004'
DMA1DCNTIP       EQU  H'0005'
DMA1ORIP         EQU  H'0006'
DMA1AIP          EQU  H'0007'


;----- IPR3 Bits -----------------------------------------------------
SPI1RXIP         EQU  H'0000'
SPI1TXIP         EQU  H'0001'
SPI1IP           EQU  H'0002'
TMR2IP           EQU  H'0003'
TMR1IP           EQU  H'0004'
TMR1GIP          EQU  H'0005'
CCP1IP           EQU  H'0006'
TMR0IP           EQU  H'0007'


;----- IPR4 Bits -----------------------------------------------------
U1RXIP           EQU  H'0000'
U1TXIP           EQU  H'0001'
U1EIP            EQU  H'0002'
U1IP             EQU  H'0003'
TMR3IP           EQU  H'0004'
TMR3GIP          EQU  H'0005'
PWM1PIP          EQU  H'0006'
PWM1IP           EQU  H'0007'


;----- IPR5 Bits -----------------------------------------------------
CLC6IP           EQU  H'0001'
TU16AIP          EQU  H'0002'
TMR6IP           EQU  H'0003'
C2IP             EQU  H'0004'
CLC2IP           EQU  H'0005'
PWM2PIP          EQU  H'0006'
PWM2IP           EQU  H'0007'


;----- IPR6 Bits -----------------------------------------------------
INT1IP           EQU  H'0000'
CLC7IP           EQU  H'0001'
CWG1IP           EQU  H'0002'
NCO1IP           EQU  H'0003'
DMA2SCNTIP       EQU  H'0004'
DMA2DCNTIP       EQU  H'0005'
DMA2ORIP         EQU  H'0006'
DMA2AIP          EQU  H'0007'


;----- IPR7 Bits -----------------------------------------------------
I2C1RXIP         EQU  H'0000'
I2C1TXIP         EQU  H'0001'
I2C1IP           EQU  H'0002'
I2C1EIP          EQU  H'0003'
CLC3IP           EQU  H'0005'
PWM3PIP          EQU  H'0006'
PWM3IP           EQU  H'0007'


;----- IPR8 Bits -----------------------------------------------------
U2RXIP           EQU  H'0000'
U2TXIP           EQU  H'0001'
U2EIP            EQU  H'0002'
U2IP             EQU  H'0003'
CLC4IP           EQU  H'0005'
CCP2IP           EQU  H'0006'
SCANIP           EQU  H'0007'


;----- IPR9 Bits -----------------------------------------------------
C1IP             EQU  H'0000'
DMA3SCNTIP       EQU  H'0004'
DMA3DCNTIP       EQU  H'0005'
DMA3ORIP         EQU  H'0006'
DMA3AIP          EQU  H'0007'


;----- IPR10 Bits -----------------------------------------------------
INT2IP           EQU  H'0000'
CLC8IP           EQU  H'0001'
TU16BIP          EQU  H'0002'
TMR4IP           EQU  H'0003'
DMA4SCNTIP       EQU  H'0004'
DMA4DCNTIP       EQU  H'0005'
DMA4ORIP         EQU  H'0006'
DMA4AIP          EQU  H'0007'


;----- IPR11 Bits -----------------------------------------------------
SPI2RXIP         EQU  H'0000'
SPI2TXIP         EQU  H'0001'
SPI2IP           EQU  H'0002'
VDDIO2LVDIP      EQU  H'0003'
VDDIO2NRDYIP     EQU  H'0004'
VDDIO2PORIP      EQU  H'0005'


;----- PIE0 Bits -----------------------------------------------------
SWIE             EQU  H'0000'
HLVDIE           EQU  H'0001'
OSFIE            EQU  H'0002'
CSWIE            EQU  H'0003'
NVMIE            EQU  H'0004'
CLC1IE           EQU  H'0005'
CRCIE            EQU  H'0006'
IOCIE            EQU  H'0007'


;----- PIE1 Bits -----------------------------------------------------
INT0IE           EQU  H'0000'
ADTIE            EQU  H'0001'
ADIE             EQU  H'0002'
ACTIE            EQU  H'0003'
I2C2RXIE         EQU  H'0004'
I2C2TXIE         EQU  H'0005'
I2C2IE           EQU  H'0006'
I2C2EIE          EQU  H'0007'


;----- PIE2 Bits -----------------------------------------------------
ZCD2IE           EQU  H'0000'
CLC5IE           EQU  H'0001'
IOCSRIE          EQU  H'0002'
ZCD1IE           EQU  H'0003'
DMA1SCNTIE       EQU  H'0004'
DMA1DCNTIE       EQU  H'0005'
DMA1ORIE         EQU  H'0006'
DMA1AIE          EQU  H'0007'


