GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F25Q24.inc
;----- INTCON1 Bits -----------------------------------------------------
STAT0_INTCON1    EQU  H'0006'
STAT1_INTCON1    EQU  H'0007'
STAT0_INTCON1    EQU  H'0006'
STAT1_INTCON1    EQU  H'0007'


;----- STATUS Bits -----------------------------------------------------
NOT_PD           EQU  H'0005'
NOT_TO           EQU  H'0006'
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
OV_STATUS        EQU  H'0003'
N                EQU  H'0004'
NPD              EQU  H'0005'
NTO              EQU  H'0006'
PD               EQU  H'0005'
TO               EQU  H'0006'


;----- FSR2L Bits -----------------------------------------------------
FSR20            EQU  H'0000'
FSR21            EQU  H'0001'
FSR22            EQU  H'0002'
FSR23            EQU  H'0003'
FSR24            EQU  H'0004'
FSR25            EQU  H'0005'
FSR26            EQU  H'0006'
FSR27            EQU  H'0007'
FSR28            EQU  H'0008'
FSR29            EQU  H'0009'
FSR210           EQU  H'0010'
FSR211           EQU  H'0011'


;----- PLUSW2 Bits -----------------------------------------------------


;----- PREINC2 Bits -----------------------------------------------------


;----- POSTDEC2 Bits -----------------------------------------------------


;----- POSTINC2 Bits -----------------------------------------------------


;----- INDF2 Bits -----------------------------------------------------


;----- FSR1L Bits -----------------------------------------------------
FSR10            EQU  H'0000'
FSR11            EQU  H'0001'
FSR12            EQU  H'0002'
FSR13            EQU  H'0003'
FSR14            EQU  H'0004'
FSR15            EQU  H'0005'
FSR16            EQU  H'0006'
FSR17            EQU  H'0007'
FSR18            EQU  H'0008'
FSR19            EQU  H'0009'
FSR110           EQU  H'0010'
FSR111           EQU  H'0011'


;----- PLUSW1 Bits -----------------------------------------------------


;----- PREINC1 Bits -----------------------------------------------------


;----- POSTDEC1 Bits -----------------------------------------------------


;----- POSTINC1 Bits -----------------------------------------------------


;----- INDF1 Bits -----------------------------------------------------


;----- WREG Bits -----------------------------------------------------


;----- FSR0L Bits -----------------------------------------------------
FSR00            EQU  H'0000'
FSR01            EQU  H'0001'
FSR02            EQU  H'0002'
FSR03            EQU  H'0003'
FSR04            EQU  H'0004'
FSR05            EQU  H'0005'
FSR06            EQU  H'0006'
FSR07            EQU  H'0007'
FSR08            EQU  H'0008'
FSR09            EQU  H'0009'
FSR010           EQU  H'0010'
FSR011           EQU  H'0011'


;----- PLUSW0 Bits -----------------------------------------------------


;----- PREINC0 Bits -----------------------------------------------------


;----- POSTDEC0 Bits -----------------------------------------------------


;----- POSTINC0 Bits -----------------------------------------------------


;----- INDF0 Bits -----------------------------------------------------


;----- PCON0 Bits -----------------------------------------------------
NOT_BOR          EQU  H'0000'
NOT_POR          EQU  H'0001'
NOT_RI           EQU  H'0002'
NOT_RMCLR        EQU  H'0003'
NOT_RWDT         EQU  H'0004'
NOT_WDTWV        EQU  H'0005'
NBOR             EQU  H'0000'
NPOR             EQU  H'0001'
NRI              EQU  H'0002'
NRMCLR           EQU  H'0003'
NRWDT            EQU  H'0004'
NWDTWV           EQU  H'0005'
STKUNF           EQU  H'0006'
STKOVF           EQU  H'0007'
BOR              EQU  H'0000'
POR              EQU  H'0001'
RI               EQU  H'0002'
RMCLR            EQU  H'0003'
RWDT             EQU  H'0004'
WDTWV            EQU  H'0005'


;----- PCON1 Bits -----------------------------------------------------
NOT_RCM          EQU  H'0000'
NOT_MEMV         EQU  H'0001'
NOT_RVREG        EQU  H'0002'
NRCM             EQU  H'0000'
NMEMV            EQU  H'0001'
NRVREG           EQU  H'0002'
MEMV             EQU  H'0001'


;----- CPUDOZE Bits -----------------------------------------------------
DOZE0            EQU  H'0000'
DOZE1            EQU  H'0001'
DOZE2            EQU  H'0002'
DOE              EQU  H'0004'
ROI              EQU  H'0005'
DOZEN            EQU  H'0006'
IDLEN            EQU  H'0007'
DOZE0            EQU  H'0000'
DOZE1            EQU  H'0001'
DOZE2            EQU  H'0002'


;----- PROD Bits -----------------------------------------------------
PROD0            EQU  H'0000'
PROD1            EQU  H'0001'
PROD2            EQU  H'0002'
PROD3            EQU  H'0003'
PROD4            EQU  H'0004'
PROD5            EQU  H'0005'
PROD6            EQU  H'0006'
PROD7            EQU  H'0007'
PROD8            EQU  H'0008'
PROD9            EQU  H'0009'
PROD10           EQU  H'0010'
PROD11           EQU  H'0011'
PROD12           EQU  H'0012'
PROD13           EQU  H'0013'
PROD14           EQU  H'0014'
PROD15           EQU  H'0015'


;----- PRODH Bits -----------------------------------------------------


;----- TABLAT Bits -----------------------------------------------------


;----- PCLAT Bits -----------------------------------------------------
PCLAT0           EQU  H'0000'
PCLAT1           EQU  H'0001'
PCLAT2           EQU  H'0002'
PCLAT3           EQU  H'0003'
PCLAT4           EQU  H'0004'
PCLAT5           EQU  H'0005'
PCLAT6           EQU  H'0006'
PCLAT7           EQU  H'0007'
PCLAT8           EQU  H'0008'
PCLAT9           EQU  H'0009'
PCLAT10          EQU  H'0010'
PCLAT11          EQU  H'0011'
PCLAT12          EQU  H'0012'
PCLAT13          EQU  H'0013'
PCLAT14          EQU  H'0014'
PCLAT15          EQU  H'0015'
PCLAT16          EQU  H'0016'
PCLAT17          EQU  H'0017'
PCLAT18          EQU  H'0018'
PCLAT19          EQU  H'0019'
PCLAT20          EQU  H'0020'


;----- PCLATH Bits -----------------------------------------------------


;----- PCLATU Bits -----------------------------------------------------
PCU0             EQU  H'0000'
PCU1             EQU  H'0001'
PCU2             EQU  H'0002'
PCU3             EQU  H'0003'
PCU4             EQU  H'0004'


;----- STKPTR Bits -----------------------------------------------------
STKPTR0          EQU  H'0000'
STKPTR1          EQU  H'0001'
STKPTR2          EQU  H'0002'
STKPTR3          EQU  H'0003'
STKPTR4          EQU  H'0004'
STKPTR5          EQU  H'0005'
STKPTR6          EQU  H'0006'
STKPTR0          EQU  H'0000'
STKPTR1          EQU  H'0001'
STKPTR2          EQU  H'0002'
STKPTR3          EQU  H'0003'
STKPTR4          EQU  H'0004'
STKPTR5          EQU  H'0005'
STKPTR6          EQU  H'0006'
SP0              EQU  H'0000'
SP1              EQU  H'0001'
SP2              EQU  H'0002'
SP3              EQU  H'0003'
SP4              EQU  H'0004'
SP5              EQU  H'0005'
SP6              EQU  H'0006'


;----- TOS Bits -----------------------------------------------------
TOS0             EQU  H'0000'
TOS1             EQU  H'0001'
TOS2             EQU  H'0002'
TOS3             EQU  H'0003'
TOS4             EQU  H'0004'
TOS5             EQU  H'0005'
TOS6             EQU  H'0006'
TOS7             EQU  H'0007'
TOS8             EQU  H'0008'
TOS9             EQU  H'0009'
TOS10            EQU  H'0010'
TOS11            EQU  H'0011'
TOS12            EQU  H'0012'
TOS13            EQU  H'0013'
TOS14            EQU  H'0014'
TOS15            EQU  H'0015'
TOS16            EQU  H'0016'
TOS17            EQU  H'0017'
TOS18            EQU  H'0018'
TOS19            EQU  H'0019'
TOS20            EQU  H'0020'


