GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F25Q24.inc
;----- CONFIG7 Options --------------------------------------------------
_BBSIZE_BBSIZE_32768_7 EQU  H'FF'; Boot Block size is 32768 words
_BBSIZE_BBSIZE_32640_7 EQU  H'FE'; Boot Block size is 32640 words
_BBSIZE_BBSIZE_32512_7 EQU  H'FD'; Boot Block size is 32512 words
_BBSIZE_BBSIZE_32384_7 EQU  H'FC'; Boot Block size is 32384 words
_BBSIZE_BBSIZE_32256_7 EQU  H'FB'; Boot Block size is 32256 words
_BBSIZE_BBSIZE_32128_7 EQU  H'FA'; Boot Block size is 32128 words
_BBSIZE_BBSIZE_32000_7 EQU  H'F9'; Boot Block size is 32000 words
_BBSIZE_BBSIZE_31872_7 EQU  H'F8'; Boot Block size is 31872 words
_BBSIZE_BBSIZE_31744_7 EQU  H'F7'; Boot Block size is 31744 words
_BBSIZE_BBSIZE_31616_7 EQU  H'F6'; Boot Block size is 31616 words
_BBSIZE_BBSIZE_31488_7 EQU  H'F5'; Boot Block size is 31488 words
_BBSIZE_BBSIZE_31360_7 EQU  H'F4'; Boot Block size is 31360 words
_BBSIZE_BBSIZE_31232_7 EQU  H'F3'; Boot Block size is 31232 words
_BBSIZE_BBSIZE_31104_7 EQU  H'F2'; Boot Block size is 31104 words
_BBSIZE_BBSIZE_30976_7 EQU  H'F1'; Boot Block size is 30976 words
_BBSIZE_BBSIZE_30848_7 EQU  H'F0'; Boot Block size is 30848 words
_BBSIZE_BBSIZE_30720_7 EQU  H'EF'; Boot Block size is 30720 words
_BBSIZE_BBSIZE_30592_7 EQU  H'EE'; Boot Block size is 30592 words
_BBSIZE_BBSIZE_30464_7 EQU  H'ED'; Boot Block size is 30464 words
_BBSIZE_BBSIZE_30336_7 EQU  H'EC'; Boot Block size is 30336 words
_BBSIZE_BBSIZE_30208_7 EQU  H'EB'; Boot Block size is 30208 words
_BBSIZE_BBSIZE_30080_7 EQU  H'EA'; Boot Block size is 30080 words
_BBSIZE_BBSIZE_29952_7 EQU  H'E9'; Boot Block size is 29952 words
_BBSIZE_BBSIZE_29824_7 EQU  H'E8'; Boot Block size is 29824 words
_BBSIZE_BBSIZE_29696_7 EQU  H'E7'; Boot Block size is 29696 words
_BBSIZE_BBSIZE_29568_7 EQU  H'E6'; Boot Block size is 29568 words
_BBSIZE_BBSIZE_29440_7 EQU  H'E5'; Boot Block size is 29440 words
_BBSIZE_BBSIZE_29312_7 EQU  H'E4'; Boot Block size is 29312 words
_BBSIZE_BBSIZE_29184_7 EQU  H'E3'; Boot Block size is 29184 words
_BBSIZE_BBSIZE_29056_7 EQU  H'E2'; Boot Block size is 29056 words
_BBSIZE_BBSIZE_28928_7 EQU  H'E1'; Boot Block size is 28928 words
_BBSIZE_BBSIZE_28800_7 EQU  H'E0'; Boot Block size is 28800 words
_BBSIZE_BBSIZE_28672_7 EQU  H'DF'; Boot Block size is 28672 words
_BBSIZE_BBSIZE_28544_7 EQU  H'DE'; Boot Block size is 28544 words
_BBSIZE_BBSIZE_28416_7 EQU  H'DD'; Boot Block size is 28416 words
_BBSIZE_BBSIZE_28288_7 EQU  H'DC'; Boot Block size is 28288 words
_BBSIZE_BBSIZE_28160_7 EQU  H'DB'; Boot Block size is 28160 words
_BBSIZE_BBSIZE_28032_7 EQU  H'DA'; Boot Block size is 28032 words
_BBSIZE_BBSIZE_27904_7 EQU  H'D9'; Boot Block size is 27904 words
_BBSIZE_BBSIZE_27776_7 EQU  H'D8'; Boot Block size is 27776 words
_BBSIZE_BBSIZE_27648_7 EQU  H'D7'; Boot Block size is 27648 words
_BBSIZE_BBSIZE_27520_7 EQU  H'D6'; Boot Block size is 27520 words
_BBSIZE_BBSIZE_27392_7 EQU  H'D5'; Boot Block size is 27392 words
_BBSIZE_BBSIZE_27264_7 EQU  H'D4'; Boot Block size is 27264 words
_BBSIZE_BBSIZE_27136_7 EQU  H'D3'; Boot Block size is 27136 words
_BBSIZE_BBSIZE_27008_7 EQU  H'D2'; Boot Block size is 27008 words
_BBSIZE_BBSIZE_26880_7 EQU  H'D1'; Boot Block size is 26880 words
_BBSIZE_BBSIZE_26752_7 EQU  H'D0'; Boot Block size is 26752 words
_BBSIZE_BBSIZE_26624_7 EQU  H'CF'; Boot Block size is 26624 words
_BBSIZE_BBSIZE_26496_7 EQU  H'CE'; Boot Block size is 26496 words
_BBSIZE_BBSIZE_26368_7 EQU  H'CD'; Boot Block size is 26368 words
_BBSIZE_BBSIZE_26240_7 EQU  H'CC'; Boot Block size is 26240 words
_BBSIZE_BBSIZE_26112_7 EQU  H'CB'; Boot Block size is 26112 words
_BBSIZE_BBSIZE_25984_7 EQU  H'CA'; Boot Block size is 25984 words
_BBSIZE_BBSIZE_25856_7 EQU  H'C9'; Boot Block size is 25856 words
_BBSIZE_BBSIZE_25728_7 EQU  H'C8'; Boot Block size is 25728 words
_BBSIZE_BBSIZE_25600_7 EQU  H'C7'; Boot Block size is 25600 words
_BBSIZE_BBSIZE_25472_7 EQU  H'C6'; Boot Block size is 25472 words
_BBSIZE_BBSIZE_25344_7 EQU  H'C5'; Boot Block size is 25344 words
_BBSIZE_BBSIZE_25216_7 EQU  H'C4'; Boot Block size is 25216 words
_BBSIZE_BBSIZE_25088_7 EQU  H'C3'; Boot Block size is 25088 words
_BBSIZE_BBSIZE_24960_7 EQU  H'C2'; Boot Block size is 24960 words
_BBSIZE_BBSIZE_24832_7 EQU  H'C1'; Boot Block size is 24832 words
_BBSIZE_BBSIZE_24704_7 EQU  H'C0'; Boot Block size is 24704 words
_BBSIZE_BBSIZE_24576_7 EQU  H'BF'; Boot Block size is 24576 words
_BBSIZE_BBSIZE_24448_7 EQU  H'BE'; Boot Block size is 24448 words
_BBSIZE_BBSIZE_24320_7 EQU  H'BD'; Boot Block size is 24320 words
_BBSIZE_BBSIZE_24192_7 EQU  H'BC'; Boot Block size is 24192 words
_BBSIZE_BBSIZE_24064_7 EQU  H'BB'; Boot Block size is 24064 words
_BBSIZE_BBSIZE_23936_7 EQU  H'BA'; Boot Block size is 23936 words
_BBSIZE_BBSIZE_23808_7 EQU  H'B9'; Boot Block size is 23808 words
_BBSIZE_BBSIZE_23680_7 EQU  H'B8'; Boot Block size is 23680 words
_BBSIZE_BBSIZE_23552_7 EQU  H'B7'; Boot Block size is 23552 words
_BBSIZE_BBSIZE_23424_7 EQU  H'B6'; Boot Block size is 23424 words
_BBSIZE_BBSIZE_23296_7 EQU  H'B5'; Boot Block size is 23296 words
_BBSIZE_BBSIZE_23168_7 EQU  H'B4'; Boot Block size is 23168 words
_BBSIZE_BBSIZE_23040_7 EQU  H'B3'; Boot Block size is 23040 words
_BBSIZE_BBSIZE_22912_7 EQU  H'B2'; Boot Block size is 22912 words
_BBSIZE_BBSIZE_22784_7 EQU  H'B1'; Boot Block size is 22784 words
_BBSIZE_BBSIZE_22656_7 EQU  H'B0'; Boot Block size is 22656 words
_BBSIZE_BBSIZE_22528_7 EQU  H'AF'; Boot Block size is 22528 words
_BBSIZE_BBSIZE_22400_7 EQU  H'AE'; Boot Block size is 22400 words
_BBSIZE_BBSIZE_22272_7 EQU  H'AD'; Boot Block size is 22272 words
_BBSIZE_BBSIZE_22144_7 EQU  H'AC'; Boot Block size is 22144 words
_BBSIZE_BBSIZE_22016_7 EQU  H'AB'; Boot Block size is 22016 words
_BBSIZE_BBSIZE_21888_7 EQU  H'AA'; Boot Block size is 21888 words
_BBSIZE_BBSIZE_21760_7 EQU  H'A9'; Boot Block size is 21760 words
_BBSIZE_BBSIZE_21632_7 EQU  H'A8'; Boot Block size is 21632 words
_BBSIZE_BBSIZE_21504_7 EQU  H'A7'; Boot Block size is 21504 words
_BBSIZE_BBSIZE_21376_7 EQU  H'A6'; Boot Block size is 21376 words
_BBSIZE_BBSIZE_21248_7 EQU  H'A5'; Boot Block size is 21248 words
_BBSIZE_BBSIZE_21120_7 EQU  H'A4'; Boot Block size is 21120 words
_BBSIZE_BBSIZE_20992_7 EQU  H'A3'; Boot Block size is 20992 words
_BBSIZE_BBSIZE_20864_7 EQU  H'A2'; Boot Block size is 20864 words
_BBSIZE_BBSIZE_20736_7 EQU  H'A1'; Boot Block size is 20736 words
_BBSIZE_BBSIZE_20608_7 EQU  H'A0'; Boot Block size is 20608 words
_BBSIZE_BBSIZE_20480_7 EQU  H'9F'; Boot Block size is 20480 words
_BBSIZE_BBSIZE_20352_7 EQU  H'9E'; Boot Block size is 20352 words
_BBSIZE_BBSIZE_20224_7 EQU  H'9D'; Boot Block size is 20224 words
_BBSIZE_BBSIZE_20096_7 EQU  H'9C'; Boot Block size is 20096 words
_BBSIZE_BBSIZE_19968_7 EQU  H'9B'; Boot Block size is 19968 words
_BBSIZE_BBSIZE_19840_7 EQU  H'9A'; Boot Block size is 19840 words
_BBSIZE_BBSIZE_19712_7 EQU  H'99'; Boot Block size is 19712 words
_BBSIZE_BBSIZE_19584_7 EQU  H'98'; Boot Block size is 19584 words
_BBSIZE_BBSIZE_19456_7 EQU  H'97'; Boot Block size is 19456 words
_BBSIZE_BBSIZE_19328_7 EQU  H'96'; Boot Block size is 19328 words
_BBSIZE_BBSIZE_19200_7 EQU  H'95'; Boot Block size is 19200 words
_BBSIZE_BBSIZE_19072_7 EQU  H'94'; Boot Block size is 19072 words
_BBSIZE_BBSIZE_18944_7 EQU  H'93'; Boot Block size is 18944 words
_BBSIZE_BBSIZE_18816_7 EQU  H'92'; Boot Block size is 18816 words
_BBSIZE_BBSIZE_18688_7 EQU  H'91'; Boot Block size is 18688 words
_BBSIZE_BBSIZE_18560_7 EQU  H'90'; Boot Block size is 18560 words
_BBSIZE_BBSIZE_18432_7 EQU  H'8F'; Boot Block size is 18432 words
_BBSIZE_BBSIZE_18304_7 EQU  H'8E'; Boot Block size is 18304 words
_BBSIZE_BBSIZE_18176_7 EQU  H'8D'; Boot Block size is 18176 words
_BBSIZE_BBSIZE_18048_7 EQU  H'8C'; Boot Block size is 18048 words
_BBSIZE_BBSIZE_17920_7 EQU  H'8B'; Boot Block size is 17920 words
_BBSIZE_BBSIZE_17792_7 EQU  H'8A'; Boot Block size is 17792 words
_BBSIZE_BBSIZE_17664_7 EQU  H'89'; Boot Block size is 17664 words
_BBSIZE_BBSIZE_17536_7 EQU  H'88'; Boot Block size is 17536 words
_BBSIZE_BBSIZE_17408_7 EQU  H'87'; Boot Block size is 17408 words
_BBSIZE_BBSIZE_17280_7 EQU  H'86'; Boot Block size is 17280 words
_BBSIZE_BBSIZE_17152_7 EQU  H'85'; Boot Block size is 17152 words
_BBSIZE_BBSIZE_17024_7 EQU  H'84'; Boot Block size is 17024 words
_BBSIZE_BBSIZE_16896_7 EQU  H'83'; Boot Block size is 16896 words
_BBSIZE_BBSIZE_16768_7 EQU  H'82'; Boot Block size is 16768 words
_BBSIZE_BBSIZE_16640_7 EQU  H'81'; Boot Block size is 16640 words
_BBSIZE_BBSIZE_16512_7 EQU  H'80'; Boot Block size is 16512 words
_BBSIZE_BBSIZE_16384_7 EQU  H'7F'; Boot Block size is 16384 words
_BBSIZE_BBSIZE_16256_7 EQU  H'7E'; Boot Block size is 16256 words
_BBSIZE_BBSIZE_16128_7 EQU  H'7D'; Boot Block size is 16128 words
_BBSIZE_BBSIZE_16000_7 EQU  H'7C'; Boot Block size is 16000 words
_BBSIZE_BBSIZE_15872_7 EQU  H'7B'; Boot Block size is 15872 words
_BBSIZE_BBSIZE_15744_7 EQU  H'7A'; Boot Block size is 15744 words
_BBSIZE_BBSIZE_15616_7 EQU  H'79'; Boot Block size is 15616 words
_BBSIZE_BBSIZE_15488_7 EQU  H'78'; Boot Block size is 15488 words
_BBSIZE_BBSIZE_15360_7 EQU  H'77'; Boot Block size is 15360 words
_BBSIZE_BBSIZE_15232_7 EQU  H'76'; Boot Block size is 15232 words
_BBSIZE_BBSIZE_15104_7 EQU  H'75'; Boot Block size is 15104 words
_BBSIZE_BBSIZE_14976_7 EQU  H'74'; Boot Block size is 14976 words
_BBSIZE_BBSIZE_14848_7 EQU  H'73'; Boot Block size is 14848 words
_BBSIZE_BBSIZE_14720_7 EQU  H'72'; Boot Block size is 14720 words
_BBSIZE_BBSIZE_14592_7 EQU  H'71'; Boot Block size is 14592 words
_BBSIZE_BBSIZE_14464_7 EQU  H'70'; Boot Block size is 14464 words
_BBSIZE_BBSIZE_14336_7 EQU  H'6F'; Boot Block size is 14336 words
_BBSIZE_BBSIZE_14208_7 EQU  H'6E'; Boot Block size is 14208 words
_BBSIZE_BBSIZE_14080_7 EQU  H'6D'; Boot Block size is 14080 words
_BBSIZE_BBSIZE_13952_7 EQU  H'6C'; Boot Block size is 13952 words
_BBSIZE_BBSIZE_13824_7 EQU  H'6B'; Boot Block size is 13824 words
_BBSIZE_BBSIZE_13696_7 EQU  H'6A'; Boot Block size is 13696 words
_BBSIZE_BBSIZE_13568_7 EQU  H'69'; Boot Block size is 13568 words
_BBSIZE_BBSIZE_13440_7 EQU  H'68'; Boot Block size is 13440 words
_BBSIZE_BBSIZE_13312_7 EQU  H'67'; Boot Block size is 13312 words
_BBSIZE_BBSIZE_13184_7 EQU  H'66'; Boot Block size is 13184 words
_BBSIZE_BBSIZE_13056_7 EQU  H'65'; Boot Block size is 13056 words
_BBSIZE_BBSIZE_12928_7 EQU  H'64'; Boot Block size is 12928 words
_BBSIZE_BBSIZE_12800_7 EQU  H'63'; Boot Block size is 12800 words
_BBSIZE_BBSIZE_12672_7 EQU  H'62'; Boot Block size is 12672 words
_BBSIZE_BBSIZE_12544_7 EQU  H'61'; Boot Block size is 12544 words
_BBSIZE_BBSIZE_12416_7 EQU  H'60'; Boot Block size is 12416 words
_BBSIZE_BBSIZE_12288_7 EQU  H'5F'; Boot Block size is 12288 words
_BBSIZE_BBSIZE_12160_7 EQU  H'5E'; Boot Block size is 12160 words
_BBSIZE_BBSIZE_12032_7 EQU  H'5D'; Boot Block size is 12032 words
_BBSIZE_BBSIZE_11904_7 EQU  H'5C'; Boot Block size is 11904 words
_BBSIZE_BBSIZE_11776_7 EQU  H'5B'; Boot Block size is 11776 words
_BBSIZE_BBSIZE_11648_7 EQU  H'5A'; Boot Block size is 11648 words
_BBSIZE_BBSIZE_11520_7 EQU  H'59'; Boot Block size is 11520 words
_BBSIZE_BBSIZE_11392_7 EQU  H'58'; Boot Block size is 11392 words
_BBSIZE_BBSIZE_11264_7 EQU  H'57'; Boot Block size is 11264 words
_BBSIZE_BBSIZE_11136_7 EQU  H'56'; Boot Block size is 11136 words
_BBSIZE_BBSIZE_11008_7 EQU  H'55'; Boot Block size is 11008 words
_BBSIZE_BBSIZE_10880_7 EQU  H'54'; Boot Block size is 10880 words
_BBSIZE_BBSIZE_10752_7 EQU  H'53'; Boot Block size is 10752 words
_BBSIZE_BBSIZE_10624_7 EQU  H'52'; Boot Block size is 10624 words
_BBSIZE_BBSIZE_10496_7 EQU  H'51'; Boot Block size is 10496 words
_BBSIZE_BBSIZE_10368_7 EQU  H'50'; Boot Block size is 10368 words
_BBSIZE_BBSIZE_10240_7 EQU  H'4F'; Boot Block size is 10240 words
_BBSIZE_BBSIZE_10112_7 EQU  H'4E'; Boot Block size is 10112 words
_BBSIZE_BBSIZE_9984_7 EQU  H'4D'; Boot Block size is 9984 words
_BBSIZE_BBSIZE_9856_7 EQU  H'4C'; Boot Block size is 9856 words
_BBSIZE_BBSIZE_9728_7 EQU  H'4B'; Boot Block size is 9728 words
_BBSIZE_BBSIZE_9600_7 EQU  H'4A'; Boot Block size is 9600 words
_BBSIZE_BBSIZE_9472_7 EQU  H'49'; Boot Block size is 9472 words
_BBSIZE_BBSIZE_9344_7 EQU  H'48'; Boot Block size is 9344 words
_BBSIZE_BBSIZE_9216_7 EQU  H'47'; Boot Block size is 9216 words
_BBSIZE_BBSIZE_9088_7 EQU  H'46'; Boot Block size is 9088 words
_BBSIZE_BBSIZE_8960_7 EQU  H'45'; Boot Block size is 8960 words
_BBSIZE_BBSIZE_8832_7 EQU  H'44'; Boot Block size is 8832 words
_BBSIZE_BBSIZE_8704_7 EQU  H'43'; Boot Block size is 8704 words
_BBSIZE_BBSIZE_8576_7 EQU  H'42'; Boot Block size is 8576 words
_BBSIZE_BBSIZE_8448_7 EQU  H'41'; Boot Block size is 8448 words
_BBSIZE_BBSIZE_8320_7 EQU  H'40'; Boot Block size is 8320 words
_BBSIZE_BBSIZE_8192_7 EQU  H'3F'; Boot Block size is 8192 words
_BBSIZE_BBSIZE_8064_7 EQU  H'3E'; Boot Block size is 8064 words
_BBSIZE_BBSIZE_7936_7 EQU  H'3D'; Boot Block size is 7936 words
_BBSIZE_BBSIZE_7808_7 EQU  H'3C'; Boot Block size is 7808 words
_BBSIZE_BBSIZE_7680_7 EQU  H'3B'; Boot Block size is 7680 words
_BBSIZE_BBSIZE_7552_7 EQU  H'3A'; Boot Block size is 7552 words
_BBSIZE_BBSIZE_7424_7 EQU  H'39'; Boot Block size is 7424 words
_BBSIZE_BBSIZE_7296_7 EQU  H'38'; Boot Block size is 7296 words
_BBSIZE_BBSIZE_7168_7 EQU  H'37'; Boot Block size is 7168 words
_BBSIZE_BBSIZE_7040_7 EQU  H'36'; Boot Block size is 7040 words
_BBSIZE_BBSIZE_6912_7 EQU  H'35'; Boot Block size is 6912 words
_BBSIZE_BBSIZE_6784_7 EQU  H'34'; Boot Block size is 6784 words
_BBSIZE_BBSIZE_6656_7 EQU  H'33'; Boot Block size is 6656 words
_BBSIZE_BBSIZE_6528_7 EQU  H'32'; Boot Block size is 6528 words
_BBSIZE_BBSIZE_6400_7 EQU  H'31'; Boot Block size is 6400 words
_BBSIZE_BBSIZE_6272_7 EQU  H'30'; Boot Block size is 6272 words
_BBSIZE_BBSIZE_6144_7 EQU  H'2F'; Boot Block size is 6144 words
_BBSIZE_BBSIZE_6016_7 EQU  H'2E'; Boot Block size is 6016 words
_BBSIZE_BBSIZE_5888_7 EQU  H'2D'; Boot Block size is 5888 words
_BBSIZE_BBSIZE_5760_7 EQU  H'2C'; Boot Block size is 5760 words
_BBSIZE_BBSIZE_5632_7 EQU  H'2B'; Boot Block size is 5632 words
_BBSIZE_BBSIZE_5504_7 EQU  H'2A'; Boot Block size is 5504 words
_BBSIZE_BBSIZE_5376_7 EQU  H'29'; Boot Block size is 5376 words
_BBSIZE_BBSIZE_5248_7 EQU  H'28'; Boot Block size is 5248 words
_BBSIZE_BBSIZE_5120_7 EQU  H'27'; Boot Block size is 5120 words
_BBSIZE_BBSIZE_4992_7 EQU  H'26'; Boot Block size is 4992 words
_BBSIZE_BBSIZE_4864_7 EQU  H'25'; Boot Block size is 4864 words
_BBSIZE_BBSIZE_4736_7 EQU  H'24'; Boot Block size is 4736 words
_BBSIZE_BBSIZE_4608_7 EQU  H'23'; Boot Block size is 4608 words
_BBSIZE_BBSIZE_4480_7 EQU  H'22'; Boot Block size is 4480 words
_BBSIZE_BBSIZE_4352_7 EQU  H'21'; Boot Block size is 4352 words
_BBSIZE_BBSIZE_4224_7 EQU  H'20'; Boot Block size is 4224 words
_BBSIZE_BBSIZE_4096_7 EQU  H'1F'; Boot Block size is 4096 words
_BBSIZE_BBSIZE_3968_7 EQU  H'1E'; Boot Block size is 3968 words
_BBSIZE_BBSIZE_3840_7 EQU  H'1D'; Boot Block size is 3840 words
_BBSIZE_BBSIZE_3712_7 EQU  H'1C'; Boot Block size is 3712 words
_BBSIZE_BBSIZE_3584_7 EQU  H'1B'; Boot Block size is 3584 words
_BBSIZE_BBSIZE_3456_7 EQU  H'1A'; Boot Block size is 3456 words
_BBSIZE_BBSIZE_3328_7 EQU  H'19'; Boot Block size is 3328 words
_BBSIZE_BBSIZE_3200_7 EQU  H'18'; Boot Block size is 3200 words
_BBSIZE_BBSIZE_3072_7 EQU  H'17'; Boot Block size is 3072 words
_BBSIZE_BBSIZE_2944_7 EQU  H'16'; Boot Block size is 2944 words
_BBSIZE_BBSIZE_2816_7 EQU  H'15'; Boot Block size is 2816 words
_BBSIZE_BBSIZE_2688_7 EQU  H'14'; Boot Block size is 2688 words
_BBSIZE_BBSIZE_2560_7 EQU  H'13'; Boot Block size is 2560 words
_BBSIZE_BBSIZE_2432_7 EQU  H'12'; Boot Block size is 2432 words
_BBSIZE_BBSIZE_2304_7 EQU  H'11'; Boot Block size is 2304 words
_BBSIZE_BBSIZE_2176_7 EQU  H'10'; Boot Block size is 2176 words
_BBSIZE_BBSIZE_2048_7 EQU  H'F0'; Boot Block size is 2048 words
_BBSIZE_BBSIZE_1920_7 EQU  H'E0'; Boot Block size is 1920 words
_BBSIZE_BBSIZE_1792_7 EQU  H'D0'; Boot Block size is 1792 words
_BBSIZE_BBSIZE_1664_7 EQU  H'C0'; Boot Block size is 1664 words
_BBSIZE_BBSIZE_1536_7 EQU  H'B0'; Boot Block size is 1536 words
_BBSIZE_BBSIZE_1408_7 EQU  H'A0'; Boot Block size is 1408 words
_BBSIZE_BBSIZE_1280_7 EQU  H'90'; Boot Block size is 1280 words
_BBSIZE_BBSIZE_1152_7 EQU  H'80'; Boot Block size is 1152 words
_BBSIZE_BBSIZE_1024_7 EQU  H'70'; Boot Block size is 1024 words
_BBSIZE_BBSIZE_896_7 EQU  H'60'; Boot Block size is 896 words
_BBSIZE_BBSIZE_768_7 EQU  H'50'; Boot Block size is 768 words
_BBSIZE_BBSIZE_640_7 EQU  H'40'; Boot Block size is 640 words
_BBSIZE_BBSIZE_512_7 EQU  H'30'; Boot Block size is 512 words
_BBSIZE_BBSIZE_384_7 EQU  H'20'; Boot Block size is 384 words
_BBSIZE_BBSIZE_256_7 EQU  H'10'; Boot Block size is 256 words
_BBSIZE_BBSIZE_128_7 EQU  H'00'; Boot Block size is 128 words

